app/controllers/pins_controller.rb

INSERT INTO "pins" ("created_at", "latitude", "longitude", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-05-23 05:39:21.759779"], ["latitude", 78.3984375], ["longitude", 17.97873309555618], ["updated_at", "2014-05-23 05:39:21.759779"]]
---
def create
  @pin = current_user.email.pins.new pin_params
  if @pin.save